import pandas as pd
import os
import sheet_name as sn


# file=os.listdir('D:/鑫速联翘状态表')[0]#读取指定文件夹下的第一个表名
#file='D:/鑫速联翘状态表.xlsx'#直接读取表名
# sheets=['1 (1)','1 (2)','1 (3)','1 (4)','1 (5)','1 (6)','1 (7)','1 (8)','1 (9)','1 (10)','1 (11)','1 (12)','1 (13)','1 (14)','1 (15)','1 (16)','1 (17)','1 (18)','1 (19)','1 (20)','1 (21)','1 (22)','1 (23)','1 (24)','1 (25)','1 (26)','1 (27)','1 (28)','1 (29)','1 (30)','1 (31)','1 (32)','1 (33)','1 (34)','1 (35)','1 (36)','1 (37)','1 (38)','1 (39)','1 (40)','1 (41)','1 (42)','1 (43)','1 (44)','1 (45)','1 (46)','1 (47)','1 (48)','1 (49)','1 (50)','1 (51)','1 (52)','1 (53)','1 (54)','1 (55)','1 (56)','1 (57)','1 (58)','1 (59)','1 (60)','1 (61)','1 (62)','1 (63)','1 (64)','1 (65)','1 (66)','1 (67)']
#----------------------------------------------------------------------读取所有sheet名-------
# data=pd.read_excel('D:/鑫速联翘状态表/'+file,None)
# print(list(data.keys()))
#--------------------------------------------------------------------------------------------

def hecheng():
	'''
	合成多个子表，表名按1,2,3,4,5,6……的规则进行命名
	:return:
	'''
	sheets = sn.sheet_name()
	D = []
	for x in sheets:
		data = pd.read_excel('D:/财务数据/结果居民/' + str(x) + '.xlsx', sheet_name='Sheet1')

		print(data)
		if data.empty is True:
			continue
		# data.rename(columns={'状态归类':'状态'},inplace=True)#状态归类和状态是同一个属性，所以我将状态归类替换成了状态
		D.append(data.loc[:, ['电厂（交易对象）编码', '名称', '动作标记', '发行日期', '含税电费', '月份', '钱', '合并时间']])
	num = pd.concat(D, axis=0)  # 合并list表D中的元素
	num.to_excel('D:/财务数据/结果居民/居民台账总表.xlsx', index=False)
